## Staging: hosted_zone
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               NAME                |
|--------|-----------------------------------|
| add    | `aws_route53_zone.form_viewer[1]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.form_viewer has moved to aws_route53_zone.form_viewer[0]
    resource "aws_route53_zone" "form_viewer" {
        id            = "Z05990652HOQ0SGHD81ZC"
        name          = "forms-staging.cdssandbox.xyz"
        tags          = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route53_zone.form_viewer[1] will be created
  + resource "aws_route53_zone" "form_viewer" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "forms-formulaires.canada.ca"
      + name_servers  = (known after apply)
      + tags          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - hosted_zone_id    = "Z05990652HOQ0SGHD81ZC" -> null
  + hosted_zone_ids   = [
      + "Z05990652HOQ0SGHD81ZC",
      + null,
    ]
  - hosted_zone_name  = "forms-staging.cdssandbox.xyz" -> null
  + hosted_zone_names = [
      + "forms-staging.cdssandbox.xyz",
      + "forms-formulaires.canada.ca",
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
